---
type: MemberForces
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 6
tags: [revit-api, class]
---

# MemberForces

`Autodesk.Revit.DB.Structure.MemberForces` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MemberForces | 2016 | `public MemberForces ( bool start , XYZ force , XYZ moment )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Force | 2016 | `public XYZ Force { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Moment | 2016 | `public XYZ Moment { get ; set ; }` |
| Property | Start | 2016 | `public bool Start { get ; set ; }` |